# Day 1

**5 differences between NoSQL and SQL Databases, with examples**

**1. SQL Databases**

*   Are primarily called Relational Databases.
*   Vertically scalable.
*   Better for multi-row transactions as they are table-based.
*   Have fixed or static predefined schema.
*   Not suited for hierarchical data storage.
*   Best suited for complex queries.
*   Follows ACID property(Atomicity, Consistency, Isolation, Durability)



**2.   NoSQL Databases**

*   Are primarily called non-relational/distributed databases
*   Horizontally scalable.
*   Better for unstructured data like documents or JSON.
*   Have a dynamic schema.
*   Best suited for hierarchical data storage.
*   Not so good for complex queries.
*   Follows CAP property(Consistency, Availability, Partition).

#Day 3

You own a business called ABC. To drive dependable decisions using data, you will develop an SQL database, call it ABC_DATA, which you will use to store all your customer info,
customer orders, product info and your order information.

In these series of challenges, in SQL you are going to do the following:
1. Create a database and name it ABC_DATA
2. Create 4 tables, in which you will insert the following datapoints:

1.1 customers
  Example Data :

  customer_id | first_name | last_name | email |
  ----------- | ----------- | -----| -------|
  1         | Joe | Doe | johndoe@email.com|


1.2 products
    Example Data :

  product_id | product_name | price |
  ----------- | ----------- | -----|
  1         | Product A | 10.00 |

 1.3 orders
    Example Data :

  order_id | customer_id | order_date |
  ----------- | ----------- | -----|
  1           | 1           | 2023-05-01 |


 1.4 order_items
    Example Data :

  order_id | product_id | quantity |
  ----------- | ----------- | -----|
  1         | 1 | 2 |

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///abc_data.db

**1.Customers' Table**

In [3]:
%%sql CREATE TABLE customers (
    customer_id INT NOT NULL,
    first_name VARCHAR(20),
    last_name VARCHAR(20),
    email VARCHAR(30) UNIQUE,
    PRIMARY KEY(customer_id)
)

 * sqlite:///abc_data.db
Done.

[]

In [4]:
%sql PRAGMA table_info(customers);

 * sqlite:///abc_data.db
Done.

[(0, 'customer_id', 'INT', 1, None, 1),
 (1, 'first_name', 'VARCHAR(20)', 0, None, 0),
 (2, 'last_name', 'VARCHAR(20)', 0, None, 0),
 (3, 'email', 'VARCHAR(30)', 0, None, 0)]

**2.Products' Table**

In [5]:
%%sql CREATE TABLE products (
    product_id INT NOT NULL PRIMARY KEY,
    product_name VARCHAR(15) UNIQUE,
    price FLOAT(4,2)
)

 * sqlite:///abc_data.db
Done.

[]

In [6]:
%sql PRAGMA table_info(products);

 * sqlite:///abc_data.db
Done.

[(0, 'product_id', 'INT', 1, None, 1),
 (1, 'product_name', 'VARCHAR(15)', 0, None, 0),
 (2, 'price', 'FLOAT(4,2)', 0, None, 0)]

**3.Orders' Table**

In [7]:
%%sql CREATE TABLE orders (
    order_id INT NOT NULL,
    customer_id INT,
    order_date DATE,
    PRIMARY KEY (order_id),
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
)

 * sqlite:///abc_data.db
Done.

[]

In [8]:
%sql PRAGMA table_info(orders);

 * sqlite:///abc_data.db
Done.

[(0, 'order_id', 'INT', 1, None, 1),
 (1, 'customer_id', 'INT', 0, None, 0),
 (2, 'order_date', 'DATE', 0, None, 0)]

**4.Order_Items' Table**

In [9]:
%%sql CREATE TABLE order_items (
    order_id INT NOT NULL,
    product_id INT,
    quantity INT,
    FOREIGN KEY (product_id) REFERENCES products(product_id)
)

 * sqlite:///abc_data.db
Done.

[]

In [10]:
%sql PRAGMA table_info(order_items);

 * sqlite:///abc_data.db
Done.

[(0, 'order_id', 'INT', 1, None, 0),
 (1, 'product_id', 'INT', 0, None, 0),
 (2, 'quantity', 'INT', 0, None, 0)]

**Selecting all table names from our db**

In [11]:
%sql SELECT name FROM sqlite_master WHERE type = 'table';

 * sqlite:///abc_data.db
Done.

[('customers',), ('products',), ('orders',), ('order_items',)]

#Day 4

This is a continuation of the day 1 challenge of creating databases. Here you will insert data, into your database, readying it for quering in the subsequent day's challenges :

**INSERT :**

**1.Customers' Table**

In [12]:
%%sql INSERT INTO customers (customer_id, first_name, last_name, email) VALUES
        (1, 'John', 'Doe', 'johndoe@email.com'),
        (2, 'Jane', 'Smith', 'janesmith@email.com'),
        (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
        (4, 'Alice', 'Brown', 'alicebrown@email.com'),
        (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
        (6, 'Eva', 'Fisher', 'evafisher@email.com'),
        (7, 'George', 'Harris', 'georgeharris@email.com'),
        (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
        (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
        (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
        (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
        (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
        (13, 'Sophia', 'Thomas', 'sophiathomas@email.com');

 * sqlite:///abc_data.db
13 rows affected.

[]

In [13]:
%sql SELECT * FROM customers;

 * sqlite:///abc_data.db
Done.

[(1, 'John', 'Doe', 'johndoe@email.com'),
 (2, 'Jane', 'Smith', 'janesmith@email.com'),
 (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
 (4, 'Alice', 'Brown', 'alicebrown@email.com'),
 (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
 (6, 'Eva', 'Fisher', 'evafisher@email.com'),
 (7, 'George', 'Harris', 'georgeharris@email.com'),
 (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
 (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
 (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
 (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
 (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
 (13, 'Sophia', 'Thomas', 'sophiathomas@email.com')]

**2.Products' Table**

In [14]:
%%sql INSERT INTO products (product_id, product_name, price) VALUES
        (1, 'Product A', 10.00),
        (2, 'Product B', 15.00),
        (3, 'Product C', 20.00),
        (4, 'Product D', 25.00),
        (5, 'Product E', 30.00),
        (6, 'Product F', 35.00),
        (7, 'Product G', 40.00),
        (8, 'Product H', 45.00),
        (9, 'Product I', 50.00),
        (10, 'Product J', 55.00),
        (11, 'Product K', 60.00),
        (12, 'Product L', 65.00),
        (13, 'Product M', 70.00);

 * sqlite:///abc_data.db
13 rows affected.

[]

In [15]:
%sql SELECT * FROM products;

 * sqlite:///abc_data.db
Done.

[(1, 'Product A', 10.0),
 (2, 'Product B', 15.0),
 (3, 'Product C', 20.0),
 (4, 'Product D', 25.0),
 (5, 'Product E', 30.0),
 (6, 'Product F', 35.0),
 (7, 'Product G', 40.0),
 (8, 'Product H', 45.0),
 (9, 'Product I', 50.0),
 (10, 'Product J', 55.0),
 (11, 'Product K', 60.0),
 (12, 'Product L', 65.0),
 (13, 'Product M', 70.0)]

**3.Orders' Table**

In [16]:
%%sql INSERT INTO orders (order_id, customer_id, order_date) VALUES
        (1, 1, '2023-05-01'),
        (2, 2, '2023-05-02'),
        (3, 3, '2023-05-03'),
        (4, 1, '2023-05-04'),
        (5, 2, '2023-05-05'),
        (6, 3, '2023-05-06'),
        (7, 4, '2023-05-07'),
        (8, 5, '2023-05-08'),
        (9, 6, '2023-05-09'),
        (10, 7, '2023-05-10'),
        (11, 8, '2023-05-11'),
        (12, 9, '2023-05-12'),
        (13, 10, '2023-05-13'),
        (14, 11, '2023-05-14'),
        (15, 12, '2023-05-15'),
        (16, 13, '2023-05-16');

 * sqlite:///abc_data.db
16 rows affected.

[]

In [17]:
%sql SELECT * FROM orders;

 * sqlite:///abc_data.db
Done.

[(1, 1, '2023-05-01'),
 (2, 2, '2023-05-02'),
 (3, 3, '2023-05-03'),
 (4, 1, '2023-05-04'),
 (5, 2, '2023-05-05'),
 (6, 3, '2023-05-06'),
 (7, 4, '2023-05-07'),
 (8, 5, '2023-05-08'),
 (9, 6, '2023-05-09'),
 (10, 7, '2023-05-10'),
 (11, 8, '2023-05-11'),
 (12, 9, '2023-05-12'),
 (13, 10, '2023-05-13'),
 (14, 11, '2023-05-14'),
 (15, 12, '2023-05-15'),
 (16, 13, '2023-05-16')]

**4.Order_items Table**

In [18]:
%%sql INSERT INTO order_items (order_id, product_id, quantity) VALUES
        (1, 1, 2),
        (1, 2, 1),
        (2, 2, 1),
        (2, 3, 3),
        (3, 1, 1),
        (3, 3, 2),
        (4, 2, 4),
        (4, 3, 1),
        (5, 1, 1),
        (5, 3, 2),
        (6, 2, 3),
        (6, 1, 1),
        (7, 4, 1),
        (7, 5, 2),
        (8, 6, 3),
        (8, 7, 1),
        (9, 8, 2),
        (9, 9, 1),
        (10, 10, 3),
        (10, 11, 2),
        (11, 12, 1),
        (11, 13, 3),
        (12, 4, 2),
        (12, 5, 1),
        (13, 6, 3),
        (13, 7, 2),
        (14, 8, 1),
        (14, 9, 2),
        (15, 10, 3),
        (15, 11, 1),
        (16, 12, 2),
        (16, 13, 3);

 * sqlite:///abc_data.db
32 rows affected.

[]

In [19]:
%sql SELECT * FROM order_items;

 * sqlite:///abc_data.db
Done.

[(1, 1, 2),
 (1, 2, 1),
 (2, 2, 1),
 (2, 3, 3),
 (3, 1, 1),
 (3, 3, 2),
 (4, 2, 4),
 (4, 3, 1),
 (5, 1, 1),
 (5, 3, 2),
 (6, 2, 3),
 (6, 1, 1),
 (7, 4, 1),
 (7, 5, 2),
 (8, 6, 3),
 (8, 7, 1),
 (9, 8, 2),
 (9, 9, 1),
 (10, 10, 3),
 (10, 11, 2),
 (11, 12, 1),
 (11, 13, 3),
 (12, 4, 2),
 (12, 5, 1),
 (13, 6, 3),
 (13, 7, 2),
 (14, 8, 1),
 (14, 9, 2),
 (15, 10, 3),
 (15, 11, 1),
 (16, 12, 2),
 (16, 13, 3)]

#Day 5

This is a continuation of the ABC Database business problem.
Here you will practice your querying skills.
Your task is to answer the following two questions:
1. Which product has the highest price? Only return a single row.
2. Which order_id had the highest number of items in terms of quantity

In [20]:
%sql SELECT product_name, price FROM products ORDER BY price DESC LIMIT 1;

 * sqlite:///abc_data.db
Done.

[('Product M', 70.0)]

In [21]:
%sql SELECT order_id, quantity FROM order_items ORDER BY quantity DESC LIMIT 1;

 * sqlite:///abc_data.db
Done.

[(4, 4)]

# Day 6

This a continuation of the previous day's challenge.
Your task will be to answer the following questions:
1. Which customer has made the most orders?
2. What’s the total revenue per product?

In [32]:
%%sql
SELECT first_name,last_name
FROM customers
JOIN orders o ON o.customer_id = customers.customer_id
JOIN orders o ON o.order_id = order_items.order_id
ORDER BY

 * sqlite:///abc_data.db
(sqlite3.OperationalError) no such column: order_items.quantity
[SQL: SELECT first_name,last_name,order_items.quantity
FROM customers
JOIN orders o ON o.customer_id = customers.customer_id
JOIN orders o ON o.order_id = order_items.order_id;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [28]:
%%sql
SELECT product_name, price * SUM(oi.quantity) AS total_revenue
FROM products
JOIN order_items oi  ON oi.product_id = products.product_id
GROUP BY product_name, price;

 * sqlite:///abc_data.db
Done.

[('Product A', 50.0),
 ('Product B', 135.0),
 ('Product C', 160.0),
 ('Product D', 75.0),
 ('Product E', 90.0),
 ('Product F', 210.0),
 ('Product G', 120.0),
 ('Product H', 135.0),
 ('Product I', 150.0),
 ('Product J', 330.0),
 ('Product K', 180.0),
 ('Product L', 195.0),
 ('Product M', 420.0)]

# Day 7

This is a continuation of the previous day's challenge.
Your task will be to answer the following questions:
1. Find the first order (by date) for each customer.
2. What’s the total revenue per product?
3. Find the day with the highest revenue.

In [29]:
%%sql
SELECT DISTINCT first_name, last_name, MIN(order_date)
FROM customers
JOIN orders o on o.customer_id = customers.customer_id
WHERE order_date LIKE '%2023-05-__'
GROUP BY first_name, last_name
ORDER BY order_date;

 * sqlite:///abc_data.db
Done.

[('John', 'Doe', '2023-05-01'),
 ('Jane', 'Smith', '2023-05-02'),
 ('Bob', 'Johnson', '2023-05-03'),
 ('Alice', 'Brown', '2023-05-07'),
 ('Charlie', 'Davis', '2023-05-08'),
 ('Eva', 'Fisher', '2023-05-09'),
 ('George', 'Harris', '2023-05-10'),
 ('Ivy', 'Jones', '2023-05-11'),
 ('Kevin', 'Miller', '2023-05-12'),
 ('Lily', 'Nelson', '2023-05-13'),
 ('Oliver', 'Patterson', '2023-05-14'),
 ('Quinn', 'Roberts', '2023-05-15'),
 ('Sophia', 'Thomas', '2023-05-16')]

In [30]:
%%sql
SELECT product_name, price * SUM(oi.quantity) AS total_revenue
FROM products
JOIN order_items oi  ON oi.product_id = products.product_id
GROUP BY product_name,price
ORDER BY product_name DESC;

 * sqlite:///abc_data.db
Done.

[('Product M', 420.0),
 ('Product L', 195.0),
 ('Product K', 180.0),
 ('Product J', 330.0),
 ('Product I', 150.0),
 ('Product H', 135.0),
 ('Product G', 120.0),
 ('Product F', 210.0),
 ('Product E', 90.0),
 ('Product D', 75.0),
 ('Product C', 160.0),
 ('Product B', 135.0),
 ('Product A', 50.0)]

In [31]:
%%sql
SELECT product_name, price * SUM(oi.quantity) AS total_revenue
FROM products
JOIN order_items oi ON oi.product_id = products.product_id
GROUP BY product_name, price
ORDER BY total_revenue DESC
LIMIT 1;

 * sqlite:///abc_data.db
Done.

[('Product M', 420.0)]